/*********************************************************************************************************
* 模块名称：LED.c
* 摘    要：LED模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "NIBP_HW_CFG.h"
#include "ADC.h"
#include "gd32f30x_conf.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void  ConfigNIBPGPIO(void);
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigNIBPGPIO
* 函数功能：配置NIBP的GPIO 
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static  void  ConfigNIBPGPIO(void)
{
  //使能RCU相关时钟
  rcu_periph_clock_enable(RCU_GPIOC);
  rcu_periph_clock_enable(RCU_GPIOA);
  
  //配置PULSE_EN引脚，默认为高电平--使能脉搏波放大
  gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_10);  
  gpio_bit_set(GPIOC, GPIO_PIN_10); 
  
  //配置BABY引脚，默认为高电平--成人模式
  gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_0);  
  gpio_bit_set(GPIOC, GPIO_PIN_0); 
  
  //配置PUMP引脚，默认为低电平--不打气
  gpio_init(GPIOA, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_1);  
  gpio_bit_reset(GPIOA, GPIO_PIN_1); 
  
  //配置VALVE_S引脚，默认为低电平--放气
  gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_3);  
  gpio_bit_reset(GPIOC, GPIO_PIN_3); 
  
  //配置VALVE_F引脚，默认为低电平--放气
  gpio_init(GPIOA, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_0);  
  gpio_bit_reset(GPIOA, GPIO_PIN_0); 
  
  //配置PROTECT_STATUE引脚，上拉输入模式；输入0--触发过压保护，输入1--未触发
  gpio_init(GPIOA, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ, GPIO_PIN_8);  
}


/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitNIBP_HW_CFG
* 函数功能：初始化NIBP硬件
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitNIBP_HW_CFG(void)
{
  ConfigNIBPGPIO();  //配置IR_RED的GPIO
}
//脉搏波放大使能
void PULSE_enable(void)
{
  gpio_bit_set(GPIOC, GPIO_PIN_10);
}
void PULSE_disable(void)
{
  gpio_bit_reset(GPIOC, GPIO_PIN_10);
}
//成人/新生儿模式选择
void Baby_mode(void)
{
  gpio_bit_reset(GPIOC, GPIO_PIN_0); 
}
void Adult_mode(void)
{
  gpio_bit_set(GPIOC, GPIO_PIN_0); 
}
//泵
void PUMU_ON(void)
{
  gpio_bit_set(GPIOA, GPIO_PIN_1); 
}
void PUMU_OFF(void)
{
  gpio_bit_reset(GPIOA, GPIO_PIN_1); 
}
//快阀
void VALVE_F_OPEN(void)
{
  gpio_bit_reset(GPIOA, GPIO_PIN_0); 
}
void VALVE_F_CLOSE(void)
{
  gpio_bit_set(GPIOA, GPIO_PIN_0); 
}
//慢阀
void VALVE_S_OPEN(void)
{
  gpio_bit_reset(GPIOC, GPIO_PIN_3); 
}
void VALVE_S_CLOSE(void)
{
  gpio_bit_set(GPIOC, GPIO_PIN_3); 
}
//过压保护--1正常，0过压
char Protect_read(void)
{
  return (gpio_input_bit_get(GPIOA,GPIO_PIN_8));
}

